#!/bin/bash
#################################################################################################
# Сценарий: roor_test.sh - использование оператора if и команды test
# Автор: Ефимова Дарья
# Дата: 27.04.2020
#################################################################################################
# Описание
# test - команда для проверки условий (альтернатива - [ выражение ])

if ! test "${1}"   
then
    echo "Отсутствует имя"   
elif
    test "${1}" = "root"  
then
    echo "Вы - суперпользователь"
else
    echo "Вы - обычный пользователь"
fi
